[M_WakeyWakey MissionDefinition]
MissionName="Pure War: Revelation Revelation"
MissionDescription="The Jaffard family holds an annual vigil for Lucky Jaffard, who killed Scooter (formerly Hodanko) several years ago. of the state and Dr. Hodunk wants to go crazy and destroy the police and kill them.."
TurnInDescription="The war between the clans has officially begun. War is coming and only one family will win.."
MissionSummary="Kill where Lucky Jafford is."
MissionGiver="Jumbo Heartonic"
MissionTurnInLocation="to come"
TeaserText="you are awake "

[M_WakeyWakey:BeerDrank MissionObjectiveDefinition]
ProgressMessage="drink beer"

[M_WakeyWakey:CrashTheWakeSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WakeyWakey:CrashtheWakewithBullets MissionObjectiveDefinition]
ProgressMessage="Retirement"

[M_WakeyWakey:GainAccess MissionObjectiveDefinition]
ProgressMessage="In the spirit of sanctity"

[M_WakeyWakey:GainAccessToLuckys MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WakeyWakey:GetDrunkSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WakeyWakey:GotoMoxxisBar MissionObjectiveDefinition]
ProgressMessage="Visit the Moxy bar."

[M_WakeyWakey:GoToMoxxisSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WakeyWakey:ReturnToEllie MissionObjectiveDefinition]
ProgressMessage="Back to Ellie."

[M_WakeyWakey:ReturnToEllieSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_WakeyWakey:ReturnToHodunks MissionObjectiveDefinition]
ProgressMessage="Introduction by Walker"

[M_WakeyWakey:ReturnToHodunkSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

